УРВ_файловая/src/Documents/ПланПроекта/ПланПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПроекта</name>
  <registerRecords>AccumulationRegister.ПланированиеПроектов_План</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ЭтапПроекта</name>
      <type>
        <types>CatalogRef.ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеЗатрат</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентАбонент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Documents/ПланПроекта/Forms/ФормаДокумента/Module.bsl
#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УстановитьВидимостьДоступность();
	Для Каждого СтрокаПоказатель из Объект.Показатели Цикл
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) или НЕ ЗначениеЗаполнено(СтрокаПоказатель.Период) Тогда
			СтрокаПоказатель.Период = НачалоМесяца(ТекущаяДатаСеанса());
		КонецЕсли;	
		СтрокаПоказатель.ПериодСтрокой = Формат(СтрокаПоказатель.Период, "ДФ = ""гггг ММММ""");
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого СтрокаСотрудник из Объект.Показатели Цикл
		ЗаполнитьДанныеПоСотруднику(СтрокаСотрудник.НомерСтроки-1);
	    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПересчитатьСуммуПоСтроке(СтрокаСотрудник.Ставка,СтрокаСотрудник.Оклад,СтрокаСотрудник.Время,СтрокаСотрудник.Период);
		КонецЕсли;	
	КонецЦикла;
	ИтогоПоПроекту = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не Копирование И НоваяСтрока Тогда
		ТекДанные = Элементы.Показатели.ТекущиеДанные;
		//ТекДанные.Статья = ЗаполнитьСтатьюНаСервере();
		ТекДанные.Период = НачалоМесяца(ТекущаяДата());
		ТекДанные.ПериодСтрокой = Формат(ТекДанные.Период, "ДФ = ""гггг ММММ""");
		
		Если ЗначениеЗаполнено(Объект.Проект) Тогда
			ТекДанные.ЭтапПроекта = УРВСервер.НайтиОсновнойЭтапДляПодстановкиВДокументы(Объект.Проект);
		Иначе
			ТекДанные.ЭтапПроекта = ПредопределенноеЗначение("Справочник.ЭтапыПроектов.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиСотрудникПриИзменении(Элемент)
	ТекущиеДанные               = Элементы.Показатели.ТекущиеДанные;
	ЗаполнитьДанныеПоСотруднику(Элементы.Показатели.ТекущаяСтрока);
	ПересчитатьСуммуПоСтроке(ТекущиеДанные.Ставка,ТекущиеДанные.Оклад,ТекущиеДанные.Время,ТекущиеДанные.Период);
	ИтогоПоПроекту              = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВремяПриИзменении(Элемент)
    ТекущиеДанные        = Элементы.Показатели.ТекущиеДанные;
	ТекущиеДанные.Сумма  = ПересчитатьСуммуПоСтроке(ТекущиеДанные.Ставка,ТекущиеДанные.Оклад,ТекущиеДанные.Время,ТекущиеДанные.Период);
	ИтогоПоПроекту       = Объект.Показатели.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПериодСтрокойПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Показатели.ТекущиеДанные;
	Если Направление = 1 Тогда
		ТекСтрока.Период = КонецМесяца(ТекСтрока.Период) + 1;
	Иначе
		ТекСтрока.Период = НачалоМесяца(НачалоМесяца(ТекСтрока.Период) - 1);
	КонецЕсли;
	
	ТекСтрока.ПериодСтрокой = Формат(ТекСтрока.Период, "ДФ = ""гггг ММММ""");
	
	ПроверитьПериодПоПроекту(ТекСтрока.НомерСтроки - 1);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для Каждого СтрокаСотрудник из Объект.Показатели Цикл
		ЗаполнитьДанныеПоСотруднику(СтрокаСотрудник.НомерСтроки-1);
		СтрокаСотрудник.ПериодСтрокой = Формат(СтрокаСотрудник.Период, "ДФ = ""гггг ММММ""");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ПоказателиКонтрагентАбонент.Видимость = Объект.Проект.УчетПоКонтрагентам;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудниковЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	Для Каждого СтрокаМассива из Результат.МассивДанных Цикл
		СтрокаПоказатели = Объект.Показатели.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказатели,СтрокаМассива);
		СтрокаПоказатели.Статья = ЗаполнитьСтатьюНаСервере();
		ЗаполнитьДанныеПоСотруднику(СтрокаПоказатели.НомерСтроки-1);
		СтрокаПоказатели.Период = НачалоМесяца(ТекущаяДата());
		СтрокаПоказатели.ПериодСтрокой = Формат(СтрокаПоказатели.Период, "ДФ = ""гггг ММММ""");
		ПересчитатьСуммуПоСтроке(СтрокаПоказатели.Ставка,СтрокаПоказатели.Оклад,СтрокаПоказатели.Время,СтрокаПоказатели.Период);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоСотруднику(НомерСтроки)
	Структура_                                   = СотрудникиСервер.ТекущаяСтавкаСотрудникаДолжностьПодразделение(Объект.Показатели[НомерСтроки].Сотрудник,Объект.Дата,Объект.Показатели[НомерСтроки].Статья);
	Объект.Показатели[НомерСтроки].Ставка        = Структура_.Ставка;
	Объект.Показатели[НомерСтроки].Оклад         = Структура_.Оклад;
	Объект.Показатели[НомерСтроки].Должность     = Структура_.Должность;
    Объект.Показатели[НомерСтроки].Подразделение = Структура_.Подразделение;
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьСтатьюНаСервере()
	Возврат Объект.Проект.ОсновнаяСтатья;
КонецФункции	

&НаСервере
Функция ПересчитатьСуммуПоСтроке(Ставка, Оклад, Время, Период)
	Если Период = Дата(1,1,1) Тогда
		Возврат 0
	КонецЕсли;
	НормаЧасовВМесяц = СотрудникиСервер.ПолучитьНормуЧасовВПериоде(НачалоМесяца(Период),КонецМесяца(Период));
	Возврат (Ставка * Время) + (Оклад * Время/НормаЧасовВМесяц);
КонецФункции	

&НаСервере
Функция ПроверитьПериодПоПроекту(ТекСтрока)
	Если Объект.Показатели[ТекСтрока].Период < Объект.Проект.ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата начала периода меньше, чем дата начала проекта";
		Сообщение.Поле = "Показатели[" + (ТекСтрока) + "].ПериодСтрокой";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
	КонецЕсли;
	Если Объект.Показатели[ТекСтрока].Период > Объект.Проект.ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания периода больше, чем дата окончания проекта";
		Сообщение.Поле = "Показатели[" + (ТекСтрока) + "].ПериодСтрокой";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
	КонецЕсли;
КонецФункции	
#КонецОбласти


#Область КОМАНДЫ_ФОРМЫ
&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораСотрудников", , ,,,, Новый ОписаниеОповещения("ПодобратьСотрудниковЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


#КонецОбласти
